# 9) fillna, dropna로 결측치 다루기

In [5]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame([])

In [9]:
df.dropna?

In [8]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})
df #numpy를 가지고 결측치가 있는 데이터를 봤다. 결측치가 있는 데이터를 어떻게 채울건지 의사결정을 해야한다.

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [10]:
df.dropna(axis=1, how='all') #axis가 0일때는 row, 1일때는 column을 의미한다.
#how = 'all'은 모두 NaN일때만 제외한다.

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [11]:
df.dropna(axis=1, how='any')
#how = 'any'는 하나라도 있으면 제외

       name
0    Alfred
1    Batman
2  Catwoman

In [12]:
df.dropna(axis=0, how='all') #drop되는 row가 하나도 없다.

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [22]:
df.fillna?

In [14]:
df.fillna(0) #결측치를 다 0으로 채운다.

       name        toy                 born
0    Alfred          0                    0
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    0

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [21]:
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, 5],
                   [np.nan, 3, np.nan, 4]],
                  columns=list('ABCD'))
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [24]:
values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
df.fillna(value=values) #각 column의 결측치를 특정 값으로 채울 수 있다.

     A    B    C  D
0  0.0  2.0  2.0  0
1  3.0  4.0  2.0  1
2  0.0  1.0  2.0  5
3  0.0  3.0  2.0  4

In [27]:
df

     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

In [26]:
df['D'].mean()

2.5

In [35]:
fill_na_value = df['D'].mean()
fill_na_value

2.5

In [36]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [37]:
fill_na_value = df['D'].median()
fill_na_value

2.5

In [38]:
df.fillna(fill_na_value)

     A    B    C  D
0  2.5  2.0  2.5  0
1  3.0  4.0  2.5  1
2  2.5  2.5  2.5  5
3  2.5  3.0  2.5  4

In [39]:
df.isnull()

       A      B     C      D
0   True  False  True  False
1  False  False  True  False
2   True   True  True  False
3   True  False  True  False

In [41]:
df.isnull().sum()

A    3
B    1
C    4
D    0
dtype: int64

In [42]:
df.notnull().sum() #결측치 아닌게 몇개인지, 결측치 몇개인지 알 수 있다.

A    1
B    3
C    0
D    4
dtype: int64